CSI API ETABS v1
cDStAISC360_22 Interface
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
public interface cDStAISC360_22
Public Interface cDStAISC360_22
Dim instance As cDStAISC360_22
public interface class cDStAISC360_22
type cDStAISC360_22 =  interface end
The cDStAISC360_22 type exposes the following members.
Methods
Name | Description
GetOverwrite
 Retrieves the value of a steel design overwrite item.
GetPreference
 Retrieves the value of a steel design preference item.
SetOverwrite
 Sets the value of a steel design overwrite item.
SetPreference
 Sets the value of a steel design preference item.
Top
See Also
Reference
ETABSv1 Namespace